-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  Mi_primer_log
       log:  C:\Users\User\Documents\MUCD_stata_intro\Sesion_1\logs\log_sesion1.smcl
  log type:  text
 opened on:  14 Jul 2022, 15:32:01

. 
. version 16

. clear all

. set linesize 80

. set more off

. 
. 
. * 1. Importar datos en formato .dta
. 
. use http://www.principlesofeconometrics.com/stata/olympics.dta, clear

. 
. summarize

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     country |      1,610    106.3528    58.96456          1        211
        year |      1,610    79.58509    11.52345         60         96
         gdp |      1,610    1.17e+11    5.09e+11   3.91e+07   7.28e+12
         pop |      1,599    2.68e+07    9.73e+07   14960.41   1.22e+09
        gold |      1,259    1.657665    6.344098          0         83
-------------+---------------------------------------------------------
      silver |      1,259    1.648928    5.281189          0         69
      bronze |      1,258    1.800477     5.03377          0         46
    medaltot |      1,259    5.105639    16.18698          0        195
        host |      1,610    .0062112    .0785903          0          1
     planned |      1,610    .0192547    .1374615          0          1
-------------+---------------------------------------------------------
      soviet |      1,610    .0416149    .1997696          0          1

. 
. use "$PATH\data\olympics.dta", clear

. 
. summarize

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     country |      1,610    106.3528    58.96456          1        211
        year |      1,610    79.58509    11.52345         60         96
         gdp |      1,610    1.17e+11    5.09e+11   3.91e+07   7.28e+12
         pop |      1,599    2.68e+07    9.73e+07   14960.41   1.22e+09
        gold |      1,259    1.657665    6.344098          0         83
-------------+---------------------------------------------------------
      silver |      1,259    1.648928    5.281189          0         69
      bronze |      1,258    1.800477     5.03377          0         46
    medaltot |      1,259    5.105639    16.18698          0        195
        host |      1,610    .0062112    .0785903          0          1
     planned |      1,610    .0192547    .1374615          0          1
-------------+---------------------------------------------------------
      soviet |      1,610    .0416149    .1997696          0          1

. 
. * 2. Importar datos en formato .csv
. 
. import delimited "$PATH\data\song_billboard_spotify.csv", encoding(UTF-8) clea
> r
(29 vars, 34,700 obs)

. 
. summarize

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          v1 |     34,700     17349.5    10017.17          0      34699
       track |          0
      artist |          0
        rank |     34,700        25.5    14.43108          1         50
peak_posit~n |     34,700    16.34236    13.48583          1         50
-------------+---------------------------------------------------------
last_posit~n |     34,700    19.81421    14.95364          0         50
number_weeks |     34,700    9.690144    8.055455          1         51
        week |          0
        name |          0
          id |          0
-------------+---------------------------------------------------------
artist_spo~y |          0
    dist_cos |     34,700    .1370234    .2237567          0          1
danceability |          0
      energy |          0
         key |          0
-------------+---------------------------------------------------------
    loudness |          0
        mode |          0
 speechiness |          0
acousticness |          0
instrument~s |          0
-------------+---------------------------------------------------------
    liveness |          0
     valence |          0
       tempo |          0
        type |          0
         uri |          0
-------------+---------------------------------------------------------
  track_href |          0
analysis_url |          0
 duration_ms |          0
time_signa~e |          0

. 
. * 3. Importar datos en Excel
. 
. import excel "$PATH\data\baseDatosCandidatos.xls", sheet("CANDIDATOS") clear
(25 vars, 480 obs)

. 
. summarize

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           A |          0
           B |          0
           C |          0
           D |          0
           E |          0
-------------+---------------------------------------------------------
           F |          0
           G |          0
           H |          0
           I |          0
           J |          0
-------------+---------------------------------------------------------
           K |          0
           L |          0
           M |          0
           N |          0
           O |          0
-------------+---------------------------------------------------------
           P |          0
           Q |          0
           R |          0
           S |          0
           T |          0
-------------+---------------------------------------------------------
           U |          0
           V |          0
           W |          0
           X |          0
           Y |          0

. 
. 
. save "$PATH\productos\datos_limpios.dta", replace
file C:\Users\User\Documents\MUCD_stata_intro\Sesion_1\productos\datos_limpios.d
> ta saved

. log close
no log file open
r(606);

end of do-file

r(606);

